# Напишите программу, удаляющую из текста все слова, содержащие ""абв"".

text = 'абв изучаемабв абвPython абв23'

res_text = text.replace('абв', '')
print(res_text)






